Repository: Error504TimeOut/MoSpeedUI
Catalog: Lang/Resources.*.resx
Languages: de

# IntroText
source: MoSpeedUI - A GUI for the MoSpeed Compiler
de: MoSpeedUI - Eine Benutzeroberfläche für den MoSpeed-Kompiler

# DragBox
source: Drag and Drop your file(s) here or click inside this Box to select them
de: Datei(en) hierhin ziehen oder klicken, um Datei(en) auszuwählen

# Step1
source: Step 1: Select your file(s)
de: 1. Datei(en) auswählen

# DragEnter
source: Drop file(s)
de: Datei(en) loslassen

# DragInvalid
source: File(s) not valid
de: Kein(e) valide(n) Datei(en)

# FilePickerTitle
source: Select file(s)
de: Datei(en) auswählen

# FilePickerDef
source: BASIC/PRG Files
de: BASIC/PRG Dateien

# FileListDesc
source: Selected file(s) (right-click to remove):
de: Ausgewählte Datei(en) (Rechtsklick zum entfernen):

# Step2
source: Step 2: Platform Configuration
de: 2. Plattformkonfiguration

source: Target Platform:
de: Zielplattform:

# PlatformSpecific
source: Platform specific configuration:
de: Plattformspezifische Konfiguration:

# C64Specific
source: Use hidden RAM (slower!)
de: Versteckten Arbeitsspeicher verwenden (langsamer!)

# EightKExpansion
source: 8K+ expansion
de: 8K+ Erweiterung

source: No expansion
de: Keine Erweiterung

# ThreeKExpansion
source: 3K expansion
de: 3K Erweiterung

# MemoryConfig
source: Select memory configuration:
de: Speicherkonfiguration auswählen:

# JSPlatformConfig
source: JavaScript does not support any platform specific configuration.
de: Für JavaScript gibt es keine verfügbaren Einstellungen.

# ProgramStart
source: Program start address:
de: Programmstartadresse:

# RuntimeStart
source: Runtime start address:
de: Runtimestartadresse:

# StringMemEnd
source: Strings memory end address:
de: Zeichenkettenspeicherendadresse:

# VarsStart
source: Variables start address:
de: Variablenstartadresse:

# DecimalOrHexWDefault
source: Enter address (decimal/$hex, empty for default)
de: Adresse eingeben (Dezimal/$Hex, leer für Standard)

# Step3
source: Step 3: Compiler Configuration
de: 3. Kompileroptionen

# MemHoles
source: Memory holes / locked regions:
de: Speicherlöcher / gesperrte Bereiche:

# CompressLvl
source: Compression level:
de: Komprimierungsstufe:

# LinkerOptBox
source: Split into multiple files
de: In mehrere Dateien aufteilen

source: Loop handling:
de: Verhalten bei Schleifen:

# SrcCdePrsc
source: Source code processing:
de: Quellcodeverarbeitung:

# CompressLvl0
source: Default (fastest)
de: Standard (am schnellesten)

# CompressLvl1
source: Medium (slower)
de: Medium (langsamer)

# CompressLvl2
source: High (even slower)
de: Hoch (noch langsamer)

# CompressLvl3
source: Higher (slowest)
de: Höher (am langsamsten)

# EndAdd
source: End address
de: Endadresse

# PSPlatformConfig
source: Powershell does not support any platform specific configuration.
de: Für Powershell gibt es keine verfügbaren Einstellungen.

# PyPlatformConfig
source: Python does not support any platform specific configuration.
de: Für Python gibt es keine verfügbaren Einstellungen.

# DecimalOrHex
source: Enter address (decimal/$hex)
de: Adresse eingeben (Dezimal/$Hex)

# SrcCdeNone
source: None
de: Keine

# SrcCdeLower
source: Convert to lower case
de: In Kleinbuchstaben umwandeln

# SrcCdeFlip
source: Flip lower/higher case
de: Groß-/Kleinschreibung umdrehen

# LoopHandlingRemove
source: Remove empty loops
de: Leere Schleifen entfernen

# LoopHandlingRetain
source: Retain empty loops
de: Leere Scheilfen erhalten

source: to
de: bis

# AddMemHole
source: Add memory hole
de: Speicherloch hinzufügen

source: Compile!
de: Kompilieren!

# Advanced
source: Advanced Compile Settings
de: Erweiterte Kompiliereinstellungen

source: Welcome!
de: Willkommen!

# SetupText
source: It seems, like you're using MoSpeedUI for the first time or the config file couldn't be found. This Setup will guide you through creating one.
de: Es scheint so, als würdest du MoSpeedUI zum ersten Mal verwenden. Zumindest konnte keine Konfigurationsdatei gefunden werden. Dieses Setup wird für dich eine erstellen.

# SetupStep1
source: Step 1: Download or Find MoSpeed
de: 1. MoSpeed herunterladen oder finden

# DwnldMS
source: Download MoSpeed
de: MoSpeed herunterladen

# FndMS
source: Find already downloaded MoSpeed
de: Bereits heruntergeladenes MoSpeed verwenden

# SetupStep2a
source: Step 2: Download MoSpeed
de: 2. MoSpeed herunterladen

# SetupStep2b
source: Step 2: Find MoSpeed
de: 2. Bereits heruntergeladenes MoSpeed verwenden

# DwnldMSBtn
source: Download MoSpeed and finish setup!
de: MoSpeed herunterladen und Setup abschließen!

# FndMSBtn
source: Find
de: Suchen

# FinishSetup
source: Check path and finish setup
de: Pfad überprüfen und Setup abschließen

# MSPickerTitle
source: Select dist/ Directory
de: dist/ Ordner auswählen

# MSPickerInvalidPath
source: The path you selected does not exist.
de: Dein ausgewählter Pfad existiert nicht.

# MSPickerNoMS
source: The path you selected does not seem to contain MoSpeed. Please make sure that the path you selected cointains a file called 'basicv2.jar'.
de: Es scheint, als würde der von dir ausgewählte Pfad MoSpeed nicht enthalten. Stelle bitte sicher, dass der Pfad, welchen du ausgewählt hast, eine Datei mit dem Namen 'basicv2.jar' enthält.

# MSPickerSuccess
source: MoSpeed has been found in the selected path. Setup is complete. Please press 'Compile!' agian.
de: MoSpeed wurde im angegebenen Pfad gefunden. Das Setup ist abgeschlossen. Bitte drücke erneut auf 'Kompilieren!'

# MSDownloadSuccess
source: MoSpeed has been successfully downloaded to:
de: MoSpeed wurde erfolgreich heruntergeladen und hier gespeichert:

# Unzip
source: Unzipping...
de: Entpacken...

# MSDownloadError
source: An error occured while trying to download MoSpeed:
de: Bei dem Versuch, MoSpeed herunterzuladen ist ein Fehler aufgetreten:

# CollectingInfo
source: Collecting compile info...
de: Kompiliereinstellungen sammeln...

# JavaNotFoundError
source: The 'java' executable could not be found or an error occured that prevented the access of java. See message:
de: Die 'java'-Exceutable konnte nicht gefunden werden oder es trat ein Fehler auf, beim Versiuch diese zu öffnen. Fehlermeldung:

# WrongJavaVersionException
source: Java was found but your Java Version does not seem to be >= 11. Extracted Java Version is {0}
de: Java wurde gefunden, aber die Java-Version scheint nicht >= 11 zu sein. Die extrahierte Java-Version lautet {0}

source: Accept
de: Akzeptieren

source: Abort
de: Abbrechen

# JavaGenericError
source: Something went wrong while trying to check for Java: {0}. However, as Java was found, you can choose to ignore this error and override this check. Every Error concerning checking for Java will be ignored that way. Only do this if you are sure that you have a Java Version greater/equal to 11. (stderr was {1})
de: Etwas ist bei dem Versuch auf Java zu überprüfen schiefgegangen: {0}. Jedoch, da Java ja gefunden wurde, kannst du diesen Fehler Ignorieren und überschreiben. Jegliche Fehler im Zusammenhang mit dem überprüfen auf Java werden dann ignoriert. Mache dies nur, wenn du dir sicher bist, dass du mindestens Java 11 hast. (stderr war {1})

# JavaWrongVersion
source: {0}. If you are sure, that you have Java 11 installed and is the default version when running 'java' press 'Accept'. (Output was: {1})
de: {0}. Wenn du dir sicher bist, dass du Java 11 oder höher installiert hast und dies die Standardversion beim Aufruf des 'java'-Befehls ist, drücke 'Akzeptieren' (Ausgabe war {1})

source: Compiling...
de: Kompilieren...

# UsingArguments
source: Using Arguments: {0}
de: Verwendete Argumente: {0}

# SaveFilePickerTitle
source: Select save location for {0} (Close dialog {1} more times to cancel)
de: Speicherort für {0} auswählen (Dialog noch {1} mal schließen zum abbrechen)

source: Close
de: Schließen

# AdvWelcome
source: You may enter parameters here that aren't available in the GUI. Please note that the parameters you enter here will get appended after all the other parameters configured via the GUI. The parameters aren't filterd. Use at own risk.
de: Hier kannst du Parameter konfigurieren, welche über das GUI nicht verfügbar sind. Bitte beachte, dass die Parameter die du hier eingibst einfach den anderen Parametern, welche über das GUI konfiguriert werden hinten angestellt werden. Es findet kein Filter o.ä. Anwendung.

source: Apply
de: Anwenden

# OpenParameterWiki
source: Open wiki for available Parameters
de: Wiki für verfügbare Parameter öffnen

# WikiUrl
source: https://www.c64-wiki.com/wiki/MOSpeed#Command_line_parameters
de: https://www.c64-wiki.de/wiki/MOSpeed#Kommandozeilenparameter

source: About
de: Über

# LicenseNote
source: This Application & the GUI Framework (Avalonia) fall under the MIT-License. Additional Licenses are also noted here. Review it below.
de: Dieses Programm & das GUI-Framework fallen unter die MIT-Lizenz. Andere Lizenzen findest du ebenfalls hier. Du kannst sie im Kasten hierunter sehen.

# OpenGit
source: Open GitHub Repo
de: GitHub-Repository öffnen

source: Report bug
de: Fehler melden

# CompileCancel
source: Compilation canceled
de: Kompilieren abgebrochen

# UpdateBtn
source: Update MoSpeed (overrides currently selected MoSpeed)
de: Update MoSpeed (überschreibt aktuell ausgewähltes MoSpeed)

# ConfirmReset
source: By updating, everything in '{0}' will be deleted if you choose to continue. The setup dialog will appear and you can choose a setup option again. Do you want to continue?
de: Wenn du updatest, wird der Inhalt von '{0}' gelöscht. Danach wird der Setup-Dialog erscheinen und du kannst eine neue Setup-Option auswählen. Möchtest du fortfahren?

source: Yes
de: Ja

# ConfigReadError
source: There has been an error reading the config file. Once you close this pop-up, everything in {0} will be deleted and the Setup will reappear. ({1})
de: Es gab einen Fehler beim lesen der Konfigurationsdatei. Sobald du dieses Pop-Up schließt, wird alles in {0} gelöscht und der Einrichtungsdialog wird erscheinen. ({1})

source: Ignore
de: Ignorieren

# NoFiles
source: No files to compile :(
de: Keine Dateien um den Kompiler zu füttern :(

# CompileJavaError
source: Oh no, an error has occured :(
de: Oh nein, ein Fehler ist aufgetreten :(

source: Finding Java...
de: Finde Java...

# WindowsJavaPanic
source: Something is very wrong. There are no fallbacks left. It seems like you have to create the config yourself. A template can be found in the wiki in the GitHub-Repo. Sorry :( (Output was: {0}, Error is {1})
de: Irgendwas ist sehr schiefgelaufen. Es gibt keine Ausweichoptionen mehr. Es scheint, als müsstest du die Konfiguration selbst erstellen. Eine Vorlage findest du in der GitHub-Repo zu diesem Projekt. Sorry :( (Ausgabe war: {0}, Fehler ist: {1})

# JavaFoundWrongVerWin
source: While there were java installations found, they don't quite seem to fit the needed version (>= 11). The Configuration will call 'java' and use the java executable that the system provides under this name. This will likely fail. Please change the <javapath> parameter in the config file to a suitable java installation.
de: Obwohl Java Installationen gefunden wurden, scheint keiner dieser die benötigte Version zu haben (>= 11). Das Programm wird auf 'java' zurückfallen und die Java-Executable verwenden, welche das System unter diesem Namen bereitstellt. Es ist wahrscheinlich, dass dies beim Kompilieren fehlschlagen wird. Bitte passe <javapath> in der Konfigurationsdatei an.

# Settings
source: App Setttings
de: App Einstellungen
